---
kind: property
id: P:Autodesk.Revit.DB.OrdinateDimensionSetting.OriginTickMarkId
source: html/f957303b-719e-67c1-6caf-8ec9380da282.htm
---
# Autodesk.Revit.DB.OrdinateDimensionSetting.OriginTickMarkId Property

Specifies the id of the tick mark element to use for the dimension origin.

## Syntax (C#)
```csharp
public ElementId OriginTickMarkId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null